Use 'drop' to drop entries

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [14]:
obj = pd.Series(np.arange(5.0), index=['a','b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [3]:
# Use 'drop' to drop an entry
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [5]:
new_obj = obj.drop(['c', 'd'])
new_obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [7]:
# Drop entries from a dataframe
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
# Drop a column. Need to specify axis
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [11]:
# Drop multiple columns. Specify axis with 'columns' keyword
data.drop(['two','four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [15]:
# Drop entries from the original data, instead of creating a new dataframe or series
# Use inplace=True
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64